/*
【程序 12 计算奖金】
题目：企业发放的奖金根据利润提成。利润(I)低于或等于 10 万元时，奖金可提 10%；利润高于 10 万
元，低于 20 万元时，低于 10 万元的部分按 10%提成，高于 10 万元的部分，可可提成 7.5%；20 万到 40
万之间时，高于 20 万元的部分，可提成 5%；40 万到 60 万之间时高于 40 万元的部分，可提成 3%；60 万
到 100 万之间时，高于 60 万元的部分，可提成 1.5%，高于 100 万元时，超过 100 万元的部分按 1%提成，
从键盘输入当月利润 I，求应发放奖金总数？
程序分析：请利用数轴来分界，定位。注意定义时需把奖金定义成长整型。
*/

import java.util.Scanner;

public class Ex12 {
	public static void main(String[] args) {
		Scanner sc = new Scanner(System.in);
		System.out.print("输入当月利润（元）：");
		long n = sc.nextInt();
		sc.close();
		double bonus;

		// 分段函数
		if (n <= 100000) {
			bonus = n * 0.1;
		} else if (n <= 200000) {
			bonus = 100000 * 0.1 + (n - 100000) * 0.075;
		} else if (n <= 400000) {
			bonus = 100000 * 0.1 + 100000 * 0.075 + (n - 200000) * 0.05;
		} else if (n <= 600000) {
			bonus = 100000 * 0.1 + 100000 * 0.075 + 200000 * 0.05 + (n - 400000) * 0.03;
		} else if (n <= 1000000) {
			bonus = 100000 * 0.1 + 100000 * 0.075 + 200000 * 0.05 + 200000 * 0.03 + (n - 600000) * 0.015 ;
		} else {
			bonus = 100000 * 0.1 + 100000 * 0.075 + 200000 * 0.05 + 200000 * 0.03 + 400000 * 0.015 + (n - 1000000) * 0.01 ;
		}

		System.out.println("应发奖金 " + bonus + "元");
	}
}